ms-python.python
ms-python.flake8
ms-python.black-formatter
ms-python.pylint
eamodio.gitlens
ms-vscode.vscode-typescript-next
esbenp.prettier-vscode
redhat.vscode-yaml
redhat.vscode-xml
Continue.continue